{
    "model_config": {
        "name": "functional",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        500
                    ],
                    "dtype": "float64",
                    "sparse": false,
                    "name": "input_layer"
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        500
                    ]
                },
                "name": "layer_normalization",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "input_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "layer_normalization",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "layer_normalization",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 128,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        500
                    ]
                },
                "name": "dense",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 128,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        500
                    ]
                },
                "name": "dense_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "layer_normalization_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "dense",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "layer_normalization_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "dense_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "dropout",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "layer_normalization_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            128
                        ],
                        [
                            null,
                            128
                        ]
                    ]
                },
                "name": "add",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            128
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "layer_normalization_2",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            128
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "dropout",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 64,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "dense_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 64,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        128
                    ]
                },
                "name": "dense_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        128
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "layer_normalization_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "dense_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_4",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "layer_normalization_4",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "dense_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "rate": 0.2,
                    "seed": null,
                    "noise_shape": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "dropout_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "layer_normalization_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "training": false
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            64
                        ],
                        [
                            null,
                            64
                        ]
                    ]
                },
                "name": "add_1",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            64
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "layer_normalization_4",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            64
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "dropout_1",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast_4",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float64"
                },
                "registered_name": "Cast",
                "name": "cast_5",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 32,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "dense_4",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast_4",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float64"
                        },
                        "registered_name": null
                    },
                    "units": 32,
                    "activation": "silu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L1L2",
                        "config": {
                            "l1": 1e-05,
                            "l2": 0.0001
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        64
                    ]
                },
                "name": "dense_5",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        64
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "cast_5",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_5",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "rms_scaling": false,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        32
                    ]
                },
                "name": "layer_normalization_5",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        32
                                    ],
                                    "dtype": "float64",
                                    "keras_history": [
                                        "dense_4",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_6",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": [
                        -1
                    ],
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
