{
    "model_config": {
        "name": "functional",
        "trainable": true,
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        null,
                        500
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer"
                },
                "registered_name": null,
                "name": "input_layer",
                "inbound_nodes": []
            },
            {
                "module": "keras.src.ops.core",
                "class_name": "Cast",
                "config": {
                    "dtype": "float16"
                },
                "registered_name": "Cast",
                "name": "cast",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "input_layer",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 512,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        500
                    ]
                },
                "name": "dense",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        500
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "cast",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "batch_normalization",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "dense",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 512,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 1e-05
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "batch_normalization",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "batch_normalization_1",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "dense_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            512
                        ],
                        [
                            null,
                            512
                        ]
                    ]
                },
                "name": "add",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            512
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "batch_normalization_1",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            512
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "batch_normalization",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 512,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 1e-05
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "batch_normalization_2",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "dense_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            512
                        ],
                        [
                            null,
                            512
                        ]
                    ]
                },
                "name": "add_1",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            512
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "batch_normalization_2",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            512
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "add",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 256,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 1e-05
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "batch_normalization_3",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "dense_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 256,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        512
                    ]
                },
                "name": "dense_4",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        512
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_1",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add_2",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            256
                        ],
                        [
                            null,
                            256
                        ]
                    ]
                },
                "name": "add_2",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            256
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "batch_normalization_3",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            256
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "dense_4",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 256,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 1e-05
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "dense_5",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_2",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_mean_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "moving_variance_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
                        "config": {},
                        "registered_name": null
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null,
                    "synchronized": false
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "batch_normalization_4",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "dense_5",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {
                            "mask": null
                        }
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Add",
                "config": {
                    "name": "add_3",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    }
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        [
                            null,
                            256
                        ],
                        [
                            null,
                            256
                        ]
                    ]
                },
                "name": "add_3",
                "inbound_nodes": [
                    {
                        "args": [
                            [
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            256
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "batch_normalization_4",
                                            0,
                                            0
                                        ]
                                    }
                                },
                                {
                                    "class_name": "__keras_tensor__",
                                    "config": {
                                        "shape": [
                                            null,
                                            256
                                        ],
                                        "dtype": "float16",
                                        "keras_history": [
                                            "add_2",
                                            0,
                                            0
                                        ]
                                    }
                                }
                            ]
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "units": 128,
                    "activation": {
                        "module": "builtins",
                        "class_name": "function",
                        "config": "Custom>swish",
                        "registered_name": "function"
                    },
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "HeNormal",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": {
                        "module": "keras.regularizers",
                        "class_name": "L2",
                        "config": {
                            "l2": 1e-05
                        },
                        "registered_name": null
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        null,
                        256
                    ]
                },
                "name": "dense_6",
                "inbound_nodes": [
                    {
                        "args": [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        256
                                    ],
                                    "dtype": "float16",
                                    "keras_history": [
                                        "add_3",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ],
                        "kwargs": {}
                    }
                ]
            },
            {
                "module": "keras.layers",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "mixed_float16"
                        },
                        "registered_name": null
                    },
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "gamma_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Ones",
